ezois_ka/oooezoiskaobmen.ИТБК_/src/Reports/ИТБК_МатериальныйОтчет/ИТБК_МатериальныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИТБК_МатериальныйОтчет</name>
  <attributes>
    <name>ФормироватьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладЦеха</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Report>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f53b3b31-9cd3-4a9b-b293-626b3a525d66">
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26caefe6-3e76-4d73-9387-208213b91b67">
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0eec1c7a-4e84-488a-a0de-5ddf74b27a9c">
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a52a5aca-aa86-429b-b461-dbd79e1dbe24">
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="955ac7a2-906a-4d2b-9be1-a41ee11cec54">
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Reports/ИТБК_МатериальныйОтчет/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	// Применяем пользовательские настройки
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	
	НастройкиКД = КомпоновщикНастроек.Настройки;
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	// Читаем параметры отчета
	ПериодОтчета  = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ДатаНачала    = ПериодОтчета.ДатаНачала;
	ДатаОкончания = ПериодОтчета.ДатаОкончания;
	
	ГотоваяПродукция      = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГотоваяПродукция")).Значение;
	ГотоваяПродукция      = ?(ЗначениеЗаполнено(ГотоваяПродукция), ГотоваяПродукция, Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина));
	
	СтатьяРасходов	      = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатьяРасходов")).Значение;
	СтатьяРасходов        = ?(ЗначениеЗаполнено(СтатьяРасходов), СтатьяРасходов, ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!!! Списание на расходы", Истина));
	
	СборкаИзКомплектующих = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СборкаИзКомплектующих")).Значение;
	СборкаИзКомплектующих = ?(ЗначениеЗаполнено(СборкаИзКомплектующих), СборкаИзКомплектующих, Перечисления.ХозяйственныеОперации.СборкаТоваров);
	
	// Читаем данные
	ТабВыпускПродукции = Отчеты.ИТБК_МатериальныйОтчет.ПолучитьВыпускПродукции(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих);
	ТабВыпускПродукции.Колонки.Добавить("ВидОперации");
	ТабВыпускПродукции.ЗаполнитьЗначения("Сборка", "ВидОперации");
	
	ТабЗатратыНаСборку = Отчеты.ИТБК_МатериальныйОтчет.ПолучитьЗатратыНаСборку(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов);
	ТабЗатратыНаСборку.Колонки.Добавить("ВидОперации");
	ТабЗатратыНаСборку.ЗаполнитьЗначения("СписаниеЗатрат", "ВидОперации");
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Изготовлено", ТабВыпускПродукции);
	ВнешниеНаборыДанных.Вставить("Потреблено" , ТабЗатратыНаСборку);
	
	// Выводим отчет
	СхемаКД	= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ДанныеРасшифровки   = Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакетаКД	= Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКД		        = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД, ДанныеРасшифровки);

    ПроцессорКД	= Новый ПроцессорКомпоновкиДанных;                                    
    ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных, ДанныеРасшифровки);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКД);
	
	// Формируем документы
	Если ФормироватьДокументы Тогда
		ДеревоДанных = Новый ДеревоЗначений;
		
		ВнешниеНаборыДанных.Вставить("Изготовлено", Новый ТаблицаЗначений); // для заполнения документов нужна только таблица списаний
		
		МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных);

		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
		ПроцессорВывода.Вывести(ПроцессорКД);
		
		ИмяФайлаОтчета    = ПолучитьИмяВременногоФайла("mxl");
		ДокументРезультат.Записать(ИмяФайлаОтчета);
		ДанныеФайлаОтчета = Новый ДвоичныеДанные(ИмяФайлаОтчета);
		АдресФайлаОтчета  = ПоместитьВоВременноеХранилище(ДанныеФайлаОтчета);
		
		Отчеты.ИТБК_МатериальныйОтчет.СформироватьДокументыПередачи(ДатаОкончания, Организация, СкладЦеха, ДеревоДанных, АдресФайлаОтчета);
	КонецЕсли;
	
КонецПроцедуры // ПриКомпоновкеРезультата()
